vvpai9/Keil/Keil_v5/ARM/INC/ADI/ADuC7126.h
// Band Gap Reference

#define          REFCON                                     (*(volatile unsigned long      *) 0xFFFF048C)

// ADC INTERFACE REGISTERS

#define          ADCCON                                     (*(volatile unsigned long      *) 0xFFFF0500)
#define          ADCCP                                      (*(volatile unsigned long      *) 0xFFFF0504)
#define          ADCCN                                      (*(volatile unsigned long      *) 0xFFFF0508)
#define          ADCSTA                                     (*(volatile unsigned long      *) 0xFFFF050C)
#define          ADCDAT                                     (*(volatile unsigned long      *) 0xFFFF0510)
#define          ADCRST                                     (*(volatile unsigned long      *) 0xFFFF0514)
#define          ADCGN                                      (*(volatile unsigned long      *) 0xFFFF0530)
#define          ADCOF                                      (*(volatile unsigned long      *) 0xFFFF0534)
#define          TSCON                                      (*(volatile unsigned long      *) 0xFFFF0544)
#define          TEMPREF                                    (*(volatile unsigned long      *) 0xFFFF0548)

// DAC INTERFACE REGISTERS

#define          DAC0CON                                    (*(volatile unsigned long      *) 0xFFFF0600)
#define          DAC0DAT                                    (*(volatile unsigned long      *) 0xFFFF0604)
#define          DAC1CON                                    (*(volatile unsigned long      *) 0xFFFF0608)
#define          DAC1DAT                                    (*(volatile unsigned long      *) 0xFFFF060C)
#define          DAC2CON                                    (*(volatile unsigned long      *) 0xFFFF0610)
#define          DAC2DAT                                    (*(volatile unsigned long      *) 0xFFFF0614)
#define          DAC3CON                                    (*(volatile unsigned long      *) 0xFFFF0618)
#define          DAC3DAT                                    (*(volatile unsigned long      *) 0xFFFF061C)
#define          DACBKEY1                                   (*(volatile unsigned long      *) 0xFFFF0650)
#define          DACBCFG                                    (*(volatile unsigned long      *) 0xFFFF0654)
#define          DACBKEY2                                   (*(volatile unsigned long      *) 0xFFFF0658)

// 450 COMPATIABLE UART CORE REGISTERS

#define          COM0TX                                     (*(volatile unsigned long      *) 0xFFFF0700)
#define          COM0RX                                     (*(volatile unsigned long      *) 0xFFFF0700)
#define          COM0DIV0                                   (*(volatile unsigned long      *) 0xFFFF0700)
#define          COM0IEN0                                   (*(volatile unsigned long      *) 0xFFFF0704)
#define          COM0DIV1                                   (*(volatile unsigned long      *) 0xFFFF0704)
#define          COM0FCR                                    (*(volatile unsigned long      *) 0xFFFF0708)
#define          COM0IID0                                   (*(volatile unsigned long      *) 0xFFFF0708)
#define          COM0CON0                                   (*(volatile unsigned long      *) 0xFFFF070C)
#define          COM0CON1                                   (*(volatile unsigned long      *) 0xFFFF0710)
#define          COM0STA0                                   (*(volatile unsigned long      *) 0xFFFF0714)
#define          COM0STA1                                   (*(volatile unsigned long      *) 0xFFFF0718)
#define          COM0DIV2                                   (*(volatile unsigned long      *) 0xFFFF072C)

// 450 COMPATIABLE UART CORE REGISTERS

#define          COM1TX                                     (*(volatile unsigned long      *) 0xFFFF0740)
#define          COM1RX                                     (*(volatile unsigned long      *) 0xFFFF0740)
#define          COM1DIV0                                   (*(volatile unsigned long      *) 0xFFFF0740)
#define          COM1IEN0                                   (*(volatile unsigned long      *) 0xFFFF0744)
#define          COM1DIV1                                   (*(volatile unsigned long      *) 0xFFFF0744)
#define          COM1FCR                                    (*(volatile unsigned long      *) 0xFFFF0748)
#define          COM1IID0                                   (*(volatile unsigned long      *) 0xFFFF0748)
#define          COM1CON0                                   (*(volatile unsigned long      *) 0xFFFF074C)
#define          COM1CON1                                   (*(volatile unsigned long      *) 0xFFFF0750)
#define          COM1STA0                                   (*(volatile unsigned long      *) 0xFFFF0754)
#define          COM1STA1                                   (*(volatile unsigned long      *) 0xFFFF0758)
#define          COM1DIV2                                   (*(volatile unsigned long      *) 0xFFFF076C)

// I2C0 BUS PERIPHERAL DEVICE 0

#define          I2C0MCON                                   (*(volatile unsigned long      *) 0xFFFF0800)
#define          I2C0MSTA                                   (*(volatile unsigned long      *) 0xFFFF0804)
#define          I2C0MRX                                    (*(volatile unsigned long      *) 0xFFFF0808)
#define          I2C0MTX                                    (*(volatile unsigned long      *) 0xFFFF080C)
#define          I2C0MCNT0                                  (*(volatile unsigned long      *) 0xFFFF0810)
#define          I2C0MCNT1                                  (*(volatile unsigned long      *) 0xFFFF0814)
#define          I2C0ADR0                                   (*(volatile unsigned long      *) 0xFFFF0818)
#define          I2C0ADR1                                   (*(volatile unsigned long      *) 0xFFFF081C)
#define          I2C0DIV                                    (*(volatile unsigned long      *) 0xFFFF0824)
#define          I2C0SCON                                   (*(volatile unsigned long      *) 0xFFFF0828)
#define          I2C0SSTA                                   (*(volatile unsigned long      *) 0xFFFF082C)
#define          I2C0SRX                                    (*(volatile unsigned long      *) 0xFFFF0830)
#define          I2C0STX                                    (*(volatile unsigned long      *) 0xFFFF0834)
#define          I2C0ALT                                    (*(volatile unsigned long      *) 0xFFFF0838)
#define          I2C0ID0                                    (*(volatile unsigned long      *) 0xFFFF083C)
#define          I2C0ID1                                    (*(volatile unsigned long      *) 0xFFFF0840)
#define          I2C0ID2                                    (*(volatile unsigned long      *) 0xFFFF0844)
#define          I2C0ID3                                    (*(volatile unsigned long      *) 0xFFFF0848)
#define          I2C0FSTA                                   (*(volatile unsigned long      *) 0xFFFF084C)

// I2C1 BUS PERIPHERAL DEVICE 0

#define          I2C1MCON                                   (*(volatile unsigned long      *) 0xFFFF0900)
#define          I2C1MSTA                                   (*(volatile unsigned long      *) 0xFFFF0904)
#define          I2C1MRX                                    (*(volatile unsigned long      *) 0xFFFF0908)
#define          I2C1MTX                                    (*(volatile unsigned long      *) 0xFFFF090C)
#define          I2C1MCNT0                                  (*(volatile unsigned long      *) 0xFFFF0910)
#define          I2C1MCNT1                                  (*(volatile unsigned long      *) 0xFFFF0914)
#define          I2C1ADR0                                   (*(volatile unsigned long      *) 0xFFFF0918)
#define          I2C1ADR1                                   (*(volatile unsigned long      *) 0xFFFF091C)
#define          I2C1DIV                                    (*(volatile unsigned long      *) 0xFFFF0924)
#define          I2C1SCON                                   (*(volatile unsigned long      *) 0xFFFF0928)
#define          I2C1SSTA                                   (*(volatile unsigned long      *) 0xFFFF092C)
#define          I2C1SRX                                    (*(volatile unsigned long      *) 0xFFFF0930)
#define          I2C1STX                                    (*(volatile unsigned long      *) 0xFFFF0934)
#define          I2C1ALT                                    (*(volatile unsigned long      *) 0xFFFF0938)
#define          I2C1ID0                                    (*(volatile unsigned long      *) 0xFFFF093C)
#define          I2C1ID1                                    (*(volatile unsigned long      *) 0xFFFF0940)
#define          I2C1ID2                                    (*(volatile unsigned long      *) 0xFFFF0944)
#define          I2C1ID3                                    (*(volatile unsigned long      *) 0xFFFF0948)
#define          I2C1FSTA                                   (*(volatile unsigned long      *) 0xFFFF094C)

// SERIAL PORT INTERFACE PERIPHERAL

#define          SPISTA                                     (*(volatile unsigned long      *) 0xFFFF0A00)
#define          SPIRX                                      (*(volatile unsigned long      *) 0xFFFF0A04)
#define          SPITX                                      (*(volatile unsigned long      *) 0xFFFF0A08)
#define          SPIDIV                                     (*(volatile unsigned long      *) 0xFFFF0A0C)
#define          SPICON                                     (*(volatile unsigned long      *) 0xFFFF0A10)

// PROGRAMABLE LOGIC ARRAY

#define          PLAELM0                                    (*(volatile unsigned long      *) 0xFFFF0B00)
#define          PLAELM1                                    (*(volatile unsigned long      *) 0xFFFF0B04)
#define          PLAELM2                                    (*(volatile unsigned long      *) 0xFFFF0B08)
#define          PLAELM3                                    (*(volatile unsigned long      *) 0xFFFF0B0C)
#define          PLAELM4                                    (*(volatile unsigned long      *) 0xFFFF0B10)
#define          PLAELM5                                    (*(volatile unsigned long      *) 0xFFFF0B14)
#define          PLAELM6                                    (*(volatile unsigned long      *) 0xFFFF0B18)
#define          PLAELM7                                    (*(volatile unsigned long      *) 0xFFFF0B1C)
#define          PLAELM8                                    (*(volatile unsigned long      *) 0xFFFF0B20)
#define          PLAELM9                                    (*(volatile unsigned long      *) 0xFFFF0B24)
#define          PLAELM10                                   (*(volatile unsigned long      *) 0xFFFF0B28)
#define          PLAELM11                                   (*(volatile unsigned long      *) 0xFFFF0B2C)
#define          PLAELM12                                   (*(volatile unsigned long      *) 0xFFFF0B30)
#define          PLAELM13                                   (*(volatile unsigned long      *) 0xFFFF0B34)
#define          PLAELM14                                   (*(volatile unsigned long      *) 0xFFFF0B38)
#define          PLAELM15                                   (*(volatile unsigned long      *) 0xFFFF0B3C)
#define          PLACLK                                     (*(volatile unsigned long      *) 0xFFFF0B40)
#define          PLAIRQ                                     (*(volatile unsigned long      *) 0xFFFF0B44)
#define          PLAADC                                     (*(volatile unsigned long      *) 0xFFFF0B48)
#define          PLADIN                                     (*(volatile unsigned long      *) 0xFFFF0B4C)
#define          PLADOUT                                    (*(volatile unsigned long      *) 0xFFFF0B50)
#define          PLALCK                                     (*(volatile unsigned long      *) 0xFFFF0B54)

// PWM

